{
    "projectsDescriptions": [
        {
            "_id": 0,
            "title": "Periodic Table",
            "tags": [
                "React.Js",
                "Frontend"
            ],
            "post": "The purpose of this project was to learn more about CSS properties and React. I wanted to build something which could be used for free by students who want to learn about Periodic Table, and have this information easy to access and in visually pleasant form.\n During building the Table I found ways of how to do it, but sadly I settled with manual adding elements due to interactivity. In order to place elements in correct way, I decided to use grid in CSS : it was easier for visualisation and placement of non empty cells into the table. ",
            "github": "https://github.com/kamiada/Mendeleev-Table"
        },
        {
            "_id": 1,
            "title": "Live!",
            "tags": [
                "React.Js",
                "Fullstack",
                "Python",
                "Flask",
                "AWS",
                "Postman",
                "API"
            ],
            "post": "The theme of BBC Platform Hackathon 2020 was connection - between people inside our organisation, especially in 2020, during the global pandemy and lockdown in United Kingdom. Therefore me and my team decided to create web application which could be repository for zoom calls across the BBC. The zoom calls would be both social calls, demonstrations of the product, meet ups, tech chats and other possibile forms of conversations about different topic. This could help people to connect, easy up knowledge sharing, socialise in safe way and learn new things. The web application would hold zoom link, the theme of the call and the amount of people currently in it - this could be helpful for people who are deeply introverted or shy. More than that, the web app would have tags based filters, generated depending to tags added to the call. Below the zoom calls we would have timeline with upcoming events and option to click on them and download outlook date-time reminder for calendars. During the Hackathon, me and my team managed to build both frontend and backend of the app. Due to the fact that I was the only person with front end knowledge, I dealt with design and build of this part of the application. Thanks to that, me and two other engineers managed to build the frontend and even add some simple CSS animation. The backend was Python+Flask API and instead of a database we used JSON file in order to build the app on time. We managed to win second place in the Hackathon and present our work during the BBC Platform Conference 2020",
            "github": "https://github.com/bbc/hackathon2020/tree/8-hacking-circus/8-hacking-circus/frontend/live"
        },
        {
            "_id": 2,
            "title": "The prototype of a mobile application for customised tourism in Edinburgh",
            "tags": [
                "Android",
                "Java",
                "Mobile App",
                "UX/UI"
            ],
            "post": "mamama"
        },
        {
            "_id": 3,
            "title": "Tracker",
            "tags": [
                "C#.Net",
                "Data gathering",
                "JavaScript",
                "Data Visualisation",
                "SQL",
                "Google Charts"
            ],
            "post": "mamama"
        },
        {
            "_id": 4,
            "title": "Panda Mediator",
            "tags": [
                "Unity",
                "Game",
                "C#",
                "Point & Click",
                "Time constraints"
            ],
            "post": "mamama",
            "links": [
                "https://globalgamejam.org/2020/games/panda-mediator-6"
            ],
            "github": "https://github.com/kamiada/GameJam2020"
        },
        {
            "_id": 5,
            "title": "Arctica",
            "tags": [
                "Unity",
                "Game",
                "C#",
                "Web"
            ],
            "post": "mamama",
            "links": [
                "https://torantula.itch.io/arctica"
            ]
        },
        {
            "_id": 6,
            "title": "Feel my feels",
            "tags": [
                "Unity",
                "Game",
                "C#",
                "Multiplayer"
            ],
            "post": "feels",
            "links": [
                "https://kamiada.itch.io/feel-my-feels"
            ],
            "github": "https://github.com/marcomoroni/ggj-2018"
        }
    ]
}